{
  "chapters": [
    {
      "id": "01",
      "title": "PLAY\nWITH\nPRINT()",
      "primaryColor": "009999",
      "secondaryColor": "006666",
      "questions": [
        {
          "id": 1,
          "title": "Write the skeleton of Dart program."
        },
        {
          "id": 2,
          "title": "Write a program to print the following output:\nHello world!!!"
        },
        {
          "id": 3,
          "title": "Write a code to print the following output:\nName:\t\tMr. X\nUniv:\t\tUniversity of Dhaka"
        },
        {
          "id": 4,
          "title": "Write a program to print the following output:\n            *\n           ***\n          *****\n         *******\n        *********\n         *******\n          *****\n           ***\n            *\n"
        },
        {
          "id": 5,
          "title": "Write a program to print the following output: [There are two blank lines in the middle]\nName:\t\tMr. DON\nCountry:\tBangladesh\n\n\nContact:\tmr.don@mycompany.com"
        }
      ]
    },
    {
      "id": "02",
      "title": "DATA TYPE\nAND\nVARIABLES",
      "primaryColor": "6611bb",
      "secondaryColor": "470c82",
      "questions": [
        {
          "id": 6,
          "title": "Take three integer variables a, b and c. Assign values to the variables- \n     a = 10, b = 20 and c = 30; Now print the sum of these three variables.\n"
        },
        {
          "id": 7,
          "title": "You are given the  radius of a circle, r = 5.5.We know that, pi=3.1416. Now write a program to calculate the area of the given circle and print it up to 2 digit after the decimal point. [The result should look like: XX.XX]"
        },

        {
          "id": 8,
          "title": " Take four double variables x, y, z and avg. Assign values to x, y and z as you want. Now calculate the average of x, y and z and assign it to avg. Finally print the average value like- \nAverage of x, y and z is: ----- .\n"
        },

        {
          "id": 9,
          "title": "Rahul got 65.00 on physics, 83.50 on mathematics, 85.75 on C programming and 67.50 on English. Now write a program to calculate the average of his marks on 4 subjects and print it up to 2 digit after the decimal point. [The result should look like: XX.XX]"
        }

             ]
    },
    {
      "id": "03",
      "title": "USER\nINPUT\nSCANF()",
      "primaryColor": "e67300",
      "secondaryColor": "a05000",
      "questions": [
        {
          "id": 10,
          "title": "Take four integer variables a, b, x and y. Scan the values of the variables from user using scanf() function. Now print the output of the following equation:\n(a*b) + (x*y)\n"
        },
        {
          "id": 11,
          "title": "Take temperature of Dhaka city as input in celsius scale from the user using double.parse function and convert it to fahrenheit and print it.\n[Formula:  F = C(9/5) +32] \n"
        },

        {
          "id": 12,
          "title": "Take a small letter alphabet as input from the user and print the capital version of that letter. [If user gives input ‘a’ you should print ‘A’]"
        }
      ]
    },
    {
      "id": "04",
      "title": "APPLY\nYOUR\nCONDITIONS",
      "primaryColor": "8ec520",
      "secondaryColor": "75a31a",
      "questions": [
        {
          "id": 13,
          "title": "Suppose you are going to apply for admission in a college. If you got GPA 5 in SSC exam then you can apply for that college. Now give your GPA as input from the keyboard and print “YES” if you can apply otherwise print “NO”."
        },
        {
          "id": 14,
          "title": "Take a value from user and assume that it is the number of his math exam.\nNow you have to write a program which shows the grade depending on the given scale.\n(A+: 80-100, A: 70-79, A-:  60-69, B: 50-59, C: 40-49,  D :33-39 ,F :0-32)\n"
        },
        {
          "id": 15,
          "title": "You are going to open a bank account .  If your age is greater than 18 then you can open an account. Get your age by input and print “Yes” if you can open an account otherwise print “No”."
        },
        {
          "id": 16,
          "title": "Write a program which determines  whether a number is ODD or EVEN."
        },
        {
          "id": 17,
          "title": "Take an integer number as input from user and print “Yes” if the number is divisible by 3 and 5. And print “No” if the number is not."
        },
        {
          "id": 18,
          "title": " Take 3 integers from user using int.parse function and write a program to find the maximum one. "
        },
        {
          "id": 19,
          "title": "Take a small letter alphabet as input and print whether it is VOWEL or CONSONANT. "
        },
        {
          "id": 20,
          "title": "Write a program that takes an integer as input ( 1 - 12 ) and print the corresponding month name.[If user gives input ‘1’ you should print ‘January’]"
        }

      ]
    },
    {
      "id": "05",
      "title": "MAGIC\nOF\nLOOP",
      "primaryColor": "144606",
      "secondaryColor": "0d2e04",
      "questions": [
        {
          "id": 21,
          "title": "Print the EVEN numbers between 1 to 100 using loop."
        },
        {
          "id": 22,
          "title": "Print the numbers between 100 to 200 which are completely divisible by 3 and 5."
        },
        {
          "id": 23,
          "title": " Write a program to print the following output using loop.\n*\n* *\n* * *\n* * * *"
        },
        {
          "id": 24,
          "title": " Take an integer as input and print it’s multiplication table up to 10. If user gives 5, your output should look like the following example-\n5 * 1 = 5\n5 * 2 = 10\n5 * 3 = 15.\n.\n.\n5 * 10 = 50\n"
        },
        {
          "id": 25,
          "title": " Find summation and average of all the numbers which are completely divisible by 3, 5 and 12 between 10 - 500. [Like 60 is divisible by all of those]"
        },
        {
          "id": 26,
          "title": "Write a program which will display all the prime numbers  between 0 to N( N will be given by the user ).\nIf user gives N = 20, your code will print the following output-\n2  3  5  7  11  13  17  19\n"
        }
      ]
    },
    {
      "id": "06",
      "title": "USES\nOF\nList\nArrays",
      "primaryColor": "27594b",
      "secondaryColor": "1f463b",
      "questions": [
        {
          "id":27,
          "title": "Take an array of integer data type of size 10. Get input from user and store the values in the array and finally print the sum of those 10 integers."
        },
        {
          "id": 28,
          "title": "Take an array of integer data type of size 5. Scan the values from the user. Now print the number of how many integers are greater than 100. "
        },
        {
          "id": 29,
          "title": "You are given the following array of integers-\n[1, 23, 10, 15, 17, 21, 44, 43, 53]. \nNow write a program which will print the prime numbers with its index.\n"
        }
      ]
    },
    {
      "id": "07",
      "title": "FUN\nOF\nFUNCTION",
      "primaryColor": "41913b",
      "secondaryColor": "4ba745",
      "questions": [
        {
          "id": 30,
          "title": "Write a function that takes two integers as input and prints their sum inside the function."
        },
        {
          "id": 31,
          "title": "Write  a function that takes an integer as input and prints EVEN if the number is divisible by 2 otherwise prints ODD. Call this function from the main function."
        },
        {
          "id": 32,
          "title": "Write a function that takes an integer as input and prints all of its divisors. Call this function from the main function."
        },
        {
          "id": 33,
          "title": "Suppose you are going to make a simple calculator. Your task is to prepare  four functions- add(), subtract(), multiply() and divide() . Each function takes two parameters and return the value after applying the corresponding action on those parameters."
        },
        {
          "id": 34,
          "title": "Write a function named findMax(). It takes three parameters and return the maximum value among the three parameters. Call this function from the main function."
        },
        {
          "id": 35,
          "title": "Write  a currency converter function named dollarToBDT(). It takes US Dollar as input in a float variable and return the amount of Bangladeshi Taka. [Change rate: 1 USD = 78.55 BDT]"
        }

      ]
    },
    {
      "id": "08",
      "title": "Dart\nWITH\nOOP",
      "primaryColor": "e7836f",
      "secondaryColor": "b45847",
      "questions": [
        {
          "id": 36,
          "title": "Dart Class Syntax"
        },
        {
          "id": 37,
          "title": "Dart classes and Object are explain properly with code"
        },
        {
          "id": 38,
          "title": "Another Example For Inheritance in Dart"
        },
        {
          "id": 39,
          "title": "write a Polymorphism Example on Dart"
        },
        {
          "id": 40,
          "title": "write a Encapsulation Example on Dart"
        },
        {
          "id": 41,
          "title": "Write a abstraction class on Dart"
        },
        {
          "id": 42,
          "title": "Write a interface class on Dart"
        }
      ]
    },
    {
      "id": "09",
      "title": "BASIC\nOF\nFILE I/O",
      "primaryColor": "b97907",
      "secondaryColor": "b17407",
      "questions": [
        {
          "id": 43,
          "title": "Write a program that opens a file named myFile.txt on write mode and write 100(integer) into that file."
        },
        {
          "id": 44,
          "title": "Write a program which will delete all the text from a text file and write “LOVE” on that file. "
        },
        {
          "id": 45,
          "title": "Create a text file in your computer and write 10 integers in 10 separate lines. Now write a program which will open the file and read that 10 integers. Finally print the average of that ten integers. "
        }
      ]
    },
    {
      "id": "10",
      "title": "MATH\nAND\nCODING",
      "primaryColor": "4f4a4a",
      "secondaryColor": "3f3b3b",
      "questions": [
        {
          "id": 46,
          "title": "Write a program which takes an integer as input and print “YES, Prime” if the number is prime otherwise “NO”."
        },
        {
          "id": 47,
          "title": "Write a program which will take the length of three sides of a triangle and print the measures of the three angles."
        },
        {
          "id": 48,
          "title": "Read two numbers A and B from user. Calculate and print the sum of their factorials. Be careful, because the result may have more than 15 digits."
        },
        {
          "id": 49,
          "title": "A dog eats just half of its supply of food in one day. Write a program that scans the initial capacity of the food supply (in Kg), and calculate how many days will pass before the dog eat all the supply food until left 1 Kg or less."
        },
        {
          "id": 50,
          "title": "Take a decimal number as input and print the binary version of that number."
        },
        {
          "id": 51,
          "title": "Write a program which will find the greatest common divisor of two numbers. If user gives input 5 and 30, your output should be 5."
        },
        {
          "id": 52,
          "title": "Write a program to calculate the nearest integer number of the square root value of a number. User will give the number as input. Your program will find the square root value of that number and print the nearest integer of that value."
        }

      ]
    }

  ]
}